Moving_vortex/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
3280
(
(0.123582250596 -0.00279466086111 0)
(0.11433785441 0.00195872503449 0)
(0.115410988297 0.00539726641351 0)
(0.114246961343 -0.00760891493905 0)
(0.125411834463 0.00311416629972 0)
(0.110515288566 0.00422100876141 0)
(0.114060073485 -0.00186903678038 0)
(0.118167069449 0.00690888635836 0)
...
)
;

boundaryField
{
    Bottom
    {
        type            cyclic;
    }
    Left
    {
        type            cyclic;
    }
    Right
    {
        type            cyclic;
    }
    Top
    {
        type            cyclic;
    }
    FrontandBack
    {
        type            empty;
    }
}


// ************************************************************************* //
