Moving_vortex/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
solvers
{

    "(rho|rhoU|rhoE)"
    {
        solver          diagonal;
    }

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-09;
        relTol          0.01;
    }

    "(h|e)"
    {
        $U;
        tolerance       1e-10;
        relTol          0;
    }


    "(nuTilda|k|omega)"
    {
        solver          smoothSolver;
        smoother        DILUGaussSeidel;
       // nSweeps         2;
       // tolerance       1e-9;
       // relTol          0.01;
    }

/*
    "(rho|rhoU|rhoE)"
    {
        solver          diagonal;
    }

  p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-9;
        relTol          0.;
    }
  pFinal
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-9;
        relTol          0.;
    }



    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-09;
        relTol          0.001;
    }

    h
    {
        $U;
        tolerance       1e-10;
        relTol          0;
    }

    e
    {
        $U;
        tolerance       1e-10;
        relTol          0;
    }
*/
}


// ************************************************************************* //
